# Encoding

In [1]:
import pandas as pd
df = pd.read_csv ('supershop.csv.csv')

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

### Finding null value in a column

In [4]:
df.isnull().sum()   # there is a null / missing in transport column

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [5]:
df.Transport   # missing at index 19

0     471784.10
1     443898.53
2     407934.54
3     383199.62
4     366168.42
5     362861.36
6     127716.82
7     323876.68
8     311613.29
9     304981.62
10    229160.95
11    249744.55
12    249839.44
13    252664.93
14    256512.92
15    261776.23
16    264346.06
17    282574.31
18    294919.57
19          NaN
20    298664.47
21    299737.29
22    303319.26
23    304768.73
24    140574.81
25    137962.62
26    134050.07
27    353183.81
28    118148.20
29    107138.38
30     91131.24
31     88218.23
32     46085.25
33    214634.81
34    210797.67
35    205517.64
36    201126.82
37    197029.42
38    185265.10
39    174999.30
40    172795.67
41    164470.71
42    148001.11
43     35534.17
44     28334.72
45      1903.93
46    297114.46
47         0.00
48         0.00
49     45173.06
Name: Transport, dtype: float64

In [6]:
df.Transport.mean()  # The above missing value can be replaced by this mean; generally mean is recommended

215331.73244897963

In [7]:
df.Transport.median() # The above missing value can be replaced by this median too

214634.81

In [8]:
df1 = df.copy()
df2 = df.copy()
df3 = df.copy()
df4 = df.copy()
df5 = df.copy()
df6 = df.copy()
df7 = df.copy()

In [9]:
df1.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [10]:
# Pandas 
df_1 = df1.dropna()            # inside () press shift+tab for more details, axis = 0 means row to be deleted. axis= 1 column

In [11]:
df_1.isnull().sum()

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [12]:
df_1.Transport  # index 19 (null) removed

0     471784.10
1     443898.53
2     407934.54
3     383199.62
4     366168.42
5     362861.36
6     127716.82
7     323876.68
8     311613.29
9     304981.62
10    229160.95
11    249744.55
12    249839.44
13    252664.93
14    256512.92
15    261776.23
16    264346.06
17    282574.31
18    294919.57
20    298664.47
21    299737.29
22    303319.26
23    304768.73
24    140574.81
25    137962.62
26    134050.07
27    353183.81
28    118148.20
29    107138.38
30     91131.24
31     88218.23
32     46085.25
33    214634.81
34    210797.67
35    205517.64
36    201126.82
37    197029.42
38    185265.10
39    174999.30
40    172795.67
41    164470.71
42    148001.11
43     35534.17
44     28334.72
45      1903.93
46    297114.46
47         0.00
48         0.00
49     45173.06
Name: Transport, dtype: float64

In [13]:
df1.shape     # verifed the null out

(50, 5)

In [14]:
df_1.shape  # verifed the null out

(49, 5)

In [15]:
df2 = df2.dropna(how='all')  # hull will not be removed, due to defining 'all' all = when all null value for a row
df2.shape    # null will be drop if how='any', because in a row all not null. default 'any'

(50, 5)

In [16]:
df3.dropna(inplace=True)  # True = auto update need to store in var; False = need to update in a seperate var

In [17]:
df3.shape

(49, 5)

In [18]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [19]:
df5.isnull().sum()  # one missing value found, we will handle it by mean

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [20]:
df.Transport = df.Transport.fillna(df.Transport.mean())  # handling missing value by mean value. if u want to replace by median, then just write median in mean(written position)

In [21]:
df.isnull().sum()  # null removed

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

In [22]:
df.Transport.mean()  # this will be visible in null postion, verify below

215331.73244897963

In [23]:
df   # verify index 19, the null alread replaced by mean value

    Marketing Spend  Administration      Transport     Area     Profit
0         114523.61       136897.80  471784.100000    Dhaka  192261.83
1         162597.70       151377.59  443898.530000      Ctg  191792.06
2         153441.51       101145.55  407934.540000  Rangpur  191050.39
3         144372.41       118671.85  383199.620000    Dhaka  182901.99
4         142107.34        91391.77  366168.420000  Rangpur  166187.94
5         131876.90        99814.71  362861.360000    Dhaka  156991.12
6         134615.46       147198.87  127716.820000      Ctg  156122.51
7         130298.13       145530.06  323876.680000  Rangpur  155752.60
8         120542.52       148718.95  311613.290000    Dhaka  152211.77
9         123334.88       108679.17  304981.620000      Ctg  149759.96
10        101913.08       110594.11  229160.950000  Rangpur  146121.95
11        100671.96        91790.61  249744.550000      Ctg  144259.40
12         93863.75       127320.38  249839.440000  Rangpur  141585.52
13         91992.39       135495.07  252664.930000      Ctg  134307.35
14        119943.24       156547.42  256512.920000  Rangpur  132602.65
15        165349.20       122616.84  261776.230000    Dhaka  129917.04
16         78013.11       121597.55  264346.060000      Ctg  126992.93
17         94657.16       145077.58  282574.310000    Dhaka  125370.37
18         91749.16       114175.79  294919.570000  Rangpur  124266.90
19         86419.70       153514.11  215331.732449    Dhaka  122776.86
20         76253.86       113867.30  298664.470000      Ctg  118474.03
21         78389.47       153773.43  299737.290000    Dhaka  111313.02
22         73994.56       122782.75  303319.260000  Rangpur  110352.25
23         67532.53       105751.03  304768.730000  Rangpur  108733.99
24         77044.01        99281.34  140574.810000    Dhaka  108552.04
25         64664.71       139553.16  137962.620000      Ctg  107404.34
26         75328.87       144135.98  134050.070000  Rangpur  105733.54
27         72107.60       127864.55  353183.810000    Dhaka  105008.31
28         66051.52       182645.56  118148.200000  Rangpur  103282.38
29         65605.48       153032.06  107138.380000    Dhaka  101004.64
30         61994.48       115641.28   91131.240000  Rangpur   99937.59
31         61136.38       152701.92   88218.230000    Dhaka   97483.56
32         63408.86       129219.61   46085.250000      Ctg   97427.84
33         55493.95       103057.49  214634.810000  Rangpur   96778.92
34         46426.07       157693.92  210797.670000      Ctg   96712.80
35         46014.02        85047.44  205517.640000    Dhaka   96479.51
36         28663.76       127056.21  201126.820000  Rangpur   90708.19
37         44069.95        51283.14  197029.420000      Ctg   89949.14
38         20229.59        65947.93  185265.100000    Dhaka   81229.06
39         38558.51        82982.09  174999.300000      Ctg   81005.76
40         28754.33       118546.05  172795.670000      Ctg   78239.91
41         27892.92        84710.77  164470.710000  Rangpur   77798.83
42         23640.93        96189.63  148001.110000      Ctg   71498.49
43         15505.73       127382.30   35534.170000    Dhaka   69758.98
44         22177.74       154806.14   28334.720000      Ctg   65200.33
45          1000.23       124153.04    1903.930000    Dhaka   64926.08
46          1315.46       115816.21  297114.460000  Rangpur   49490.75
47             0.00       135426.92       0.000000      Ctg   42559.73
48           542.05        51743.15       0.000000    Dhaka   35673.41
49             0.00       116983.80   45173.060000      Ctg   14681.40

In [24]:
df.Area.unique()   # Getting Unique Value

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

# Withoud Encoding Technique

In [25]:
df.Area = df.Area.replace(['Dhaka', 'Ctg', 'Rangpur'], [1,2,3])

In [26]:
df.Area # Repace by definition 1 = Dhaka, 2= Ctg, 3 = Rangpur

0     1
1     2
2     3
3     1
4     3
5     1
6     2
7     3
8     1
9     2
10    3
11    2
12    3
13    2
14    3
15    1
16    2
17    1
18    3
19    1
20    2
21    1
22    3
23    3
24    1
25    2
26    3
27    1
28    3
29    1
30    3
31    1
32    2
33    3
34    2
35    1
36    3
37    2
38    1
39    2
40    2
41    3
42    2
43    1
44    2
45    1
46    3
47    2
48    1
49    2
Name: Area, dtype: int64

In [27]:
df.head()   # See the update

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     2  191792.06
2        153441.51       101145.55  407934.54     3  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     3  166187.94

# Label Encoder

In [28]:
#http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.LabelEncoder.html
from sklearn.preprocessing import LabelEncoder

In [29]:
le = LabelEncoder() # object creation

In [30]:
df1.head()  # see the dataset

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [31]:
df1.Area = le.fit_transform(df1.Area)   # Ses the encoding as per alphabatic order
df1.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

In [32]:
import numpy as np
df.columns           # see all the columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [33]:
df4.head()   # Original data before encoding

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [34]:
# Label Encoder using for loop
import numpy as np

import warnings as wr     # to ignore warnings
wr.filterwarnings('ignore')

for column in df4.columns:               # loop will run for all columns in df4
    if df4[column].dtype == np.number:    # no encoding for number, when df4 column contain numbers. it will check dtype whether its number not not,then continue
        continue
    df4[column] = le.fit_transform(df4[column])    # otherwise le to encoding by transform when its not number

In [35]:
df4.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# Alternative way for encoding

In [36]:
df5.head()  # Original data

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [37]:
from pandas.core.dtypes.common import is_numeric_dtype

In [38]:
for column in df5.columns:
    if is_numeric_dtype(df5[column]):
        continue
    else:                                    # in case of last line, it works without else too
        df5[column] = le.fit_transform(df5[column])

In [39]:
df5.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoder

In [40]:
df6.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [41]:
# lets takes some additional copies for further use
df8 = df6.copy()
df9 = df6.copy()
df10 = df6.copy()
df11 = df6.copy()
df12 = df6.copy()

In [42]:
dummy = pd.get_dummies(df6['Area'])   # as per one hot rule, take dummy var by get_dummies fn. inside () shift+ tab for details

In [43]:
dummy.head()    # after this execution the column "Area" needed to be dropped

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [44]:
df6 = df6.drop('Area', axis = 1)

In [45]:
df6.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [46]:
dummy = pd.get_dummies(df7['Area'], prefix='encoded')   # shift+tab, you can define any text/comment as prefix
dummy.head()

   encoded_Ctg  encoded_Dhaka  encoded_Rangpur
0            0              1                0
1            1              0                0
2            0              0                1
3            0              1                0
4            0              0                1

In [47]:
dummy = pd.get_dummies(df7['Area'], prefix='Area',drop_first=True)  # 'Dummy var trap' drop_first=True meana auto delete of first col, False is default
dummy.head()

   Area_Dhaka  Area_Rangpur
0           1             0
1           0             0
2           0             1
3           1             0
4           0             1

### Now need to concate df6 (without area col) & dummy

In [48]:
new_df6 = pd.concat([df6,dummy], axis=1)  # axis =1 because of adding columns

In [49]:
new_df6.head()

,Marketing Spend,Administration,Transport,Profit,Area_Dhaka,Area_Rangpur
0,114523.61,136897.80,471784.10,192261.83,1,0
1,162597.70,151377.59,443898.53,191792.06,0,0
2,153441.51,101145.55,407934.54,191050.39,0,1
3,144372.41,118671.85,383199.62,182901.99,1,0
4,142107.34,91391.77,366168.42,166187.94,0,1

### One Hot Encoding by for loop (Now do the same by loop)

In [50]:
col = ['Area']   # for which column, we want area col

for column in col:
    one = pd.get_dummies(df8[column], drop_first=True, prefix='Area')  # 2nd portionf for "dummy var trap"
    df8 = pd.concat([df7, one], axis=1).drop(column, axis=1)  # df7,one (var, which I get after one hot encoding as above var)

In [51]:
df8.head()

,Marketing Spend,Administration,Transport,Profit,Area_Dhaka,Area_Rangpur
0,114523.61,136897.80,471784.10,192261.83,1,0
1,162597.70,151377.59,443898.53,191792.06,0,0
2,153441.51,101145.55,407934.54,191050.39,0,1
3,144372.41,118671.85,383199.62,182901.99,1,0
4,142107.34,91391.77,366168.42,166187.94,0,1

# Ordinal

In [52]:
df9.Area.unique()  # Getting unique value

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [53]:
city = ['Dhaka', 'Ctg', 'Rangpur']

from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder(categories=[city])

In [54]:
ordinal

OrdinalEncoder(categories=[['Dhaka', 'Ctg', 'Rangpur']])

In [55]:
encoded = ordinal.fit_transform(df9[['Area']])  # [[]] e.g at the same time no.of rows & no.of colmns both will be executed

In [56]:
encoded   # see encoded value

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.],
       [1.],
       [2.],
       [1.],
       [0.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.]])

In [57]:
en = pd.DataFrame(encoded, columns=['area1'])   # see the data frame
en.head()

   area1
0    0.0
1    1.0
2    2.0
3    0.0
4    2.0

In [58]:
df9.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

### Now dropping area from df9 and add area1(new area) - system

#### Concate the drop & add by for loop

In [61]:
cols = ['Area']

for col in cols:
    unique = df10[col].unique()
    df10[col] = OrdinalEncoder(categories=[unique]).fit_transform(df10[[col]])

In [62]:
df10.head()    # Original Area removed & add new Area/ area1

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10   0.0  192261.83
1        162597.70       151377.59  443898.53   1.0  191792.06
2        153441.51       101145.55  407934.54   2.0  191050.39
3        144372.41       118671.85  383199.62   0.0  182901.99
4        142107.34        91391.77  366168.42   2.0  166187.94